leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxPort_bf.h
/** \brief  Mask for Ifx_P_OMSR_Bits.PS6 */
#define IFX_P_OMSR_PS6_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR_Bits.PS6 */
#define IFX_P_OMSR_PS6_OFF (6u)

/** \brief  Length for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR_Bits.PS7 */
#define IFX_P_OMSR_PS7_OFF (7u)

/** \brief  Length for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR_Bits.PS8 */
#define IFX_P_OMSR_PS8_OFF (8u)

/** \brief  Length for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_LEN (1u)

/** \brief  Mask for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_MSK (0x1u)

/** \brief  Offset for Ifx_P_OMSR_Bits.PS9 */
#define IFX_P_OMSR_PS9_OFF (9u)

/** \brief  Length for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P0 */
#define IFX_P_OUT_P0_OFF (0u)

/** \brief  Length for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P10 */
#define IFX_P_OUT_P10_OFF (10u)

/** \brief  Length for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P11 */
#define IFX_P_OUT_P11_OFF (11u)

/** \brief  Length for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P12 */
#define IFX_P_OUT_P12_OFF (12u)

/** \brief  Length for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P13 */
#define IFX_P_OUT_P13_OFF (13u)

/** \brief  Length for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P14 */
#define IFX_P_OUT_P14_OFF (14u)

/** \brief  Length for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P15 */
#define IFX_P_OUT_P15_OFF (15u)

/** \brief  Length for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P1 */
#define IFX_P_OUT_P1_OFF (1u)

/** \brief  Length for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P2 */
#define IFX_P_OUT_P2_OFF (2u)

/** \brief  Length for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P3 */
#define IFX_P_OUT_P3_OFF (3u)

/** \brief  Length for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P4 */
#define IFX_P_OUT_P4_OFF (4u)

/** \brief  Length for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P5 */
#define IFX_P_OUT_P5_OFF (5u)

/** \brief  Length for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P6 */
#define IFX_P_OUT_P6_OFF (6u)

/** \brief  Length for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P7 */
#define IFX_P_OUT_P7_OFF (7u)

/** \brief  Length for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P8 */
#define IFX_P_OUT_P8_OFF (8u)

/** \brief  Length for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_LEN (1u)

/** \brief  Mask for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_MSK (0x1u)

/** \brief  Offset for Ifx_P_OUT_Bits.P9 */
#define IFX_P_OUT_P9_OFF (9u)

/** \brief  Length for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_LEN (1u)

/** \brief  Mask for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_MSK (0x1u)

/** \brief  Offset for Ifx_P_PCSR_Bits.LCK */
#define IFX_P_PCSR_LCK_OFF (31u)

/** \brief  Length for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_LEN (1u)

/** \brief  Mask for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_MSK (0x1u)

/** \brief  Offset for Ifx_P_PCSR_Bits.SEL10 */
#define IFX_P_PCSR_SEL10_OFF (10u)

/** \brief  Length for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_LEN (1u)

/** \brief  Mask for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_MSK (0x1u)

/** \brief  Offset for Ifx_P_PCSR_Bits.SEL1 */
#define IFX_P_PCSR_SEL1_OFF (1u)

/** \brief  Length for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_LEN (1u)

/** \brief  Mask for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_MSK (0x1u)

/** \brief  Offset for Ifx_P_PCSR_Bits.SEL2 */
#define IFX_P_PCSR_SEL2_OFF (2u)

/** \brief  Length for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_LEN (1u)

/** \brief  Mask for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_MSK (0x1u)

/** \brief  Offset for Ifx_P_PCSR_Bits.SEL9 */
#define IFX_P_PCSR_SEL9_OFF (9u)

/** \brief  Length for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_LEN (1u)

/** \brief  Mask for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_MSK (0x1u)

/** \brief  Offset for Ifx_P_PDISC_Bits.PDIS0 */
#define IFX_P_PDISC_PDIS0_OFF (0u)

/** \brief  Length for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_LEN (1u)

/** \brief  Mask for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_MSK (0x1u)

/** \brief  Offset for Ifx_P_PDISC_Bits.PDIS10 */
#define IFX_P_PDISC_PDIS10_OFF (10u)

/** \brief  Length for Ifx_P_PDISC_Bits.PDIS11 */
#define IFX_P_PDISC_PDIS11_LEN (1u)

